user = "root"
password = "SanPauluKgd487"
db_name = "test1"
host = "localhost"
port = 3306
id_admin = -1001176047527

filepath_user_photo = 'C:/Users/Lario/Desktop/autumnEvent2021/photos/'
filepath_user_qr_code = 'C:/Users/Lario/Desktop/autumnEvent2021/qr_codes/'
filepath_user_ticket = 'C:/Users/Lario/Desktop/autumnEvent2021/tickets/'

teachers = {"10А":"Березина Людмила Леонтьевна","10Г":"Шевцова Любовь Васильевна","10И":"Аллахвердянц Гаянэ Эдуардовна",
            "10К":"Немченко Елена Владимировна","10Л":"Савенкова Людмила Валерьевна",
            "11П":"Ащева Снежанна Викторовна","11В":"Кузьмина Лилия Владимировна","11Г":"Джабиев Андрей Тофикович",
            "11М":"Буткевич Ирина Геннадьевна","11С":"Трифонова Александра Евгеньевна", "11Е":"Отставных Евгения Анатольевна"}

classes = ["10А", "10Г", "10И", "10К", "10Л", "11М", "11В", "11П", "11Г", "11С", "11Е"]

info_message = "Это бот регистрации на осенний бал в гимназии №40\nМероприятие состоится 31 ноября 2021, а время проведения - с 19:00 до 21:00\nДля использования бота есть несколько команд:\n/reg - запуск процесса регистрации\n/name - ввод имени и фамилии\n" \
               "/grade - ввод класса обучения\n/check - проверка введённой информации\n/send - отправка данных для обработки\n/status - текущий статус заявки\n/help - написать в поддержку"

status_list = ['приглашён', 'в обработке', 'отклонена']

apiKey = 1851132100:AAE0fOc9Z0K5wSGouW_OVdkvIKExlT4qNUQ